<template>
  <div class="main">
    <p class="title">实验教学项目持续建设服务计划</p>
    <p class="two-title">1.项目持续建设与服务计划：</p>
    <p class="content">&nbsp;&nbsp;（1）继续完善本实验教学项目，并结合《动画运动规律》、《原动画设计》、教学大纲，开发《动画造型》、《动画场景设计》、《三维动画基础》等3门课程的虚拟仿真实验项目。</p>
    <p class="content">&nbsp;&nbsp;（2）提升教学和服务能力，增加实验教学硬件设施的投入，完善平台的接入和运行能力，针对不同专业和知识水平的学生进行有效的管理，并提供自动评分和在线辅导功能。</p>
    <p class="content">&nbsp;&nbsp;（3）以本校《动画运动规律》、《原动画设计》、《三维动画短片》等方向的专业课程实验教学为主，扩展面向本校其他专业方向，数字媒体专业、电竞专业等相关课程的实验教学。</p>
    <p class="content">&nbsp;&nbsp;（4）增强平台对优质资源的共享能力和稳定性，满足更大的用户并发访问。加强虚实统一管理能力，结合我校虚拟仿真实际教学情况，建立校级开放式虚拟仿真管理平台。2019-2020年主要面向江苏省内本科院校，并邀请部分国内院校参与；2021-2022年面向全国本科院校开放，并对国内主要汽车企业开放；2023 年开始面向全国所有高校和国内动画企业及工作室等开放，允许符合条件的社会机构接入</p>
    <br>

    <p class="content" >后续经费投入计划:</p>
    <p class="content">
      目前，依托于江苏省高校重点建设实验室“数字艺术创意应用”及江苏省品牌专业（动画）一期建设工程项目支持，金陵科技学院动漫学院已完成动作捕捉实验室前期建设投入及相关软件平台开发共计费用730万元，在前期已建设条件基础上，学院在未来三年时间再投入实验室专项经费300万元，经费主要来源包括中央扶持地方资金专项150万元，江苏省一流专业（动画）专项资金50万元，江苏省设计学一级学科专项经费100万元。该资金主要用于以下三个部分：
    </p>
    <p class="content">&nbsp;&nbsp;（1）动作捕捉实验室硬件升级项目150万，包括面部捕捉系统升级改造、云存储服务器及融合系统升级。</p>
    <p class="content">&nbsp;&nbsp;（2）虚拟仿真项目平台升级项目开发费用120万，包括多人多景开发、复杂动作开发、面部表情捕捉等模块。</p>
    <p class="content">&nbsp;&nbsp;（3）项目服务器升级及云平台建设费用30万，包括项目服务器升级、云平台开发及调试、校内共享接口及移动平台开发等。</p>
    <br>
    <p class="content" style="margin-bottom:5px;">具体规划如下：  </p>
    <div>
        <img src="./image/plan.png" alt="" style="width:420px;height:200px;">
    </div>
    <br>

    <!-- <p class="two-title">2.面向高校的教学推广应用计划：
    <p class="content">&nbsp;&nbsp;（1）未来学科建设过程中，通过举办会议、成立论坛、接待参访等形式，与校内外及国内外兄弟院校、相关机构的对口院系进行虚拟实验资源项目建设思路、经验和成果的资源共享；多市及省内的其它相关专业的学校和学生能共享我们的建设成果，培养学生的综合创新能力服务；</p>
    <p class="content">&nbsp;&nbsp;（2）综合应用多媒体、大数据、三维建模、人工智能、人机交互、传感器、超级计算、虚拟现实、增强现实、云计算等网络化、数字化、智能化技术手段，丰富虚拟仿真实验内容，优化**实验；举办**技能大赛，促进和提升学生的专业实践能力。</p>

    <br> -->

    <p class="two-title">2.面向社会的推广应用计划：</p>
     <p class="content">&nbsp;&nbsp;（1）通过举办会议、成立论坛、接待参访等形式，与校内外及国内外院校、动画企业和研究机构建立有效的资源共享平台；国内其它相关专业的学校和学生能共享我们的建设成果，为培养学生的综合创新能力服务。</p>
    <p class="content">&nbsp;&nbsp;（2）综合应用动作捕捉、大数据、三维建模、人工智能、人机交互、传感器、超级计算、VR 虚拟现实、增强现实、云计算等网络化、数字化、智能化技术手段，优化实验项目，丰富虚拟仿真实验内容；举办相关技能大赛，促进和提升学生的专业实践能力。</p>
  </div>
</template>

<script>
export default {
  name: "PlanTemp",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }

  .two-title {
    @include sc(16px, #333333);
    line-height: 22px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
  }
}
</style>
