<template>
  <div class="main">
    <p class="title">实验教学项目特色</p>
    <p class="two-title">实验方案设计思路：</p>
    <p class="content">
        该虚拟仿真实验的必要性： 
    </p>
    <p class="content">
      在动画专业教学中，将动作捕捉技术用于动画制作，可以极大地提高动画制作的水平和效率，降低制作成本，使动画制作过程更为直观，效果更为生动。动作捕捉实验需要较大的实验空间和高昂的实验设备，实验环境搭建困难，很多高校无法完成完整实验的制作。在实际进行实验时，需要有专业技术人员完成技术保障，设备仪器调试复杂、动作捕捉效果难以应用。
    </p>
    <p class="content">
      “基于动作捕捉技术的动画角色表演设计虚拟仿真实验”真实还原了动作捕捉项目的全过程，利用捕捉结果结合动画运动规律中“人的运动规律”教学要点，同时结合速度和镜头角度调整在灵活多变的动画场景中实时完整再现动画角色表演动作实验全过程，提供有效实验数据，具有“以虚补实，虚实结合”的鲜明特色，实现“深度交互、理实融合”的教学效果。
    </p>
    <br>
    <p class="content">
      该虚拟仿真实验的先进性主要是：
    </p>
    <p class="content">
      （1）全面融合动作捕捉、虚拟仪器、虚拟实验室、有限元仿真软件、三维场景与 VR、人机在线交互等技术，实验项目易学易用、界面友好，学生参与度高、沉浸性强，解决了该项目实验过程复杂、实验器材昂贵、学生参与度低，实体教学实验难以开展的问题，具有“以虚补实，虚实结合”的鲜明特色。
    </p>
    <p class="content">
      （2）以动画专业人才培养要求为导向，将原动画设计、动画运动规律等理论内容和分析、实验操作、仿真计算、技术标准应用等知识纵横交互，融合贯通，加深了学生对动画角色复杂运动形态的深入理解，有效锻炼和培养学生分析和解决复杂设计问题的能力，实现“深度交互、理实融合”的教学效果。
    </p>
    <br>

    <p class="two-title">实验教学方法：</p>
    <p class="content">
        将动作捕捉技术、虚拟仪器与 VR 技术、有限元仿真软件、人机在线交互等技术综合运用，激发学生的学习兴趣。学生通过相关理论课程的学习和相关专业软件的使用，可以自主在线完成全部实验内容。
    </p>
    <p class="content">通过该实验教学，学生可以学习和掌握动画角色表演中较为复杂的动作设计的基本内容，将复杂的、专业性强的动作，如舞蹈动作、武术动作、体育运动等，从节奏、速度、时间等方面，分解为多角度、多侧面的单帧画面，并能够使其的镜头表现丰富化，让复杂动作能够更为直观、明确，学生能够对复杂动作的细节有充分的了解，弥补了传统教学中单一镜头、固定模式的表现形式。</p>
    <p class="content">该实验操作交互性强，学生深度参与，理实融合，循序渐进，体验感较好，从而解决当前实验教学中普遍存在学生只看不做、操作少、体验差、参与度低的问题，达到良好的教学效果。</p>
    <br>

    <p class="two-title">评价体系：</p>
    <p class="content">
        该虚拟实验系统自动记录学生实验操作过程和实验数据使用过程，进行综合评价得到学生的实验成绩。学生完成实验后，还必须在虚拟仿真实验系统上完成实验报告，老师在线上对学生提交的实验报告进行综合评价。
        <br>
        该实验项目在开放式虚拟仿真实验教学管理系统和共享平台上运行，教师可利用该平台在线上安排学生预习、指导学生实验和批改实验报告并与学生互动交流，实现了全流程、一体化、交互式的教学管理与评价。
    </p>
    <br>

    <p class="two-title">传统教学的延伸与拓展：</p>
    <p class="content">
        本实验项目在《动画运动规律》、《原画设计》、《动画造型》、《三维动画短片》等课程基础上，运用动作捕捉技术，通过虚拟仿真实验系统的转换和优化，
        学生可在三维场景下开展“动画角色表演动作捕捉虚拟仿真实验项目”，学习动画角色表演动作捕捉实验的基本内容、仪器设备、操作步骤和数据分析方法，实现对传统理论教学和实验教学的延伸和拓展。
    </p>
  </div>
</template>

<script>
export default {
  name: "FeatureTemp",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }

  .two-title {
    @include sc(16px, #333333);
    line-height: 22px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
  }
}
</style>
