<template>
  <div class="main">
    <p class="title">面向学生要求</p>
    <p class="content">
        （1）专业与年级要求<br>
        本虚拟仿真实验主要面向动画专业的大三、大四学生。对学生的基本知识和能力要求：全面掌握《动画运动规律》、《二维动画基础》、《原动画设计》、《三维动画基础》、
        《三维艺术动画小品》、《二维艺术动画小品》、《动画短片》等课程的基本知识点以及关键重、难点。
    </p>

    <p class="content">
        （2）基本知识和能力要求<br>
        在使用本虚拟仿真实验系统学习前，应掌握基本的动画基础相关课程。本专业学生主要学习电影、电视动画创作的基础知识与基本理论，受到影视动画设计、影视动画技法、
        影视动画制作的基本训练，掌握动画设计、动画编导、动画创作及理论研究的基本能力。掌握影视动画创作的基本理论、基本知识；掌握影视动画设计及制作的技能。
    </p>

    <p class="content">
        （3）专业核心能力培养<br>
        动画造型能力、动漫设计与制作能力、影视动画设计与制作能力。本专业是动画设计和漫画设计的有机结合，是影视动画专业的深化与延伸。要求学生在动画设计的理论基础上，
        掌握漫画设计的原则及表现技巧，了解影视及每体领域的发展方向，掌握一定的理论知识及专业技能。具有较高的审美素养，较强的视觉感受功能里和视觉表现能力;掌握动漫画的基本原理和基础理论，
        并能在实践中融会贯通;掌握动漫画的各种表现语言和表现技巧，有较强的专业设计能力和创造能力;能熟练运用计算机进行专业的辅助设计和创作。
    </p>
  </div>
</template>

<script>
export default {
  name: "FaceStudent",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
    margin-bottom: 15px;
  }
}
</style>
