<template>
  <div class="main">
    <p class="title">实验教学方法</p>

    <p class="content">根据《动画运动规律》、《原画设计》课程教学要求和实验教学内容以及实验教学方法，利用动作捕捉、人机交互、虚拟现实、智能网络等技术，开发完成“基于动作捕捉技术的动画角色表演设计虚拟仿真实验”的教学项目，解决了该实验项目角色表演动作复杂、实验器材昂贵、学生参与度低，实体教学实验难以开展的问题。学生和相关的技术人员在开放、自主、交互的虚拟环境中，安全、经济、高效地进行实验，取得良好的教学效果和工程设计应用效果。
    </p>

    <p class="content">1、教学方法使用目的 </p>
    <p class="content">
        （1）解决实体教学实验难以开展的问题 <br>
        作为一名动画设计人员，竭尽所能地创造出一个角色，然后通过绘画或电脑技术的表现方式将其传递给观众。一部好的动画作品给我们留下深刻印象的往往是因其表演，但是往往在传统教学里的一些复杂动作很难让学生有直观的认识和理解。因此通过该虚拟仿真实验可以通过动作捕捉和数据采集学习和掌握动画角色表演中较为复杂的动作设计的基本内容，直观准确逼真地通过 3D 和 VR 方式多角度、多侧面表达出来，学生能够对复杂动作的细节有充分的了解，弥补了传统教学中单一镜头、固定模式的表现形式
    </p>
    <p class="content">
        （2）提高学生开展综合性自主性实验的积极性，激发学生学习兴趣 <br>
        把虚拟仿真技术应用于实验教学，创设基于问题的实验教学方法、基于案例的实验教学方法以及基于真实情境、综合实战的实验教学方法等。
        变教师主导为学生自主；变必须完成全部实验为学生自主选择；变教师灌输为启发、讨论和互动。<br><br>
        建立符合学生认知规律的教学程序，采取多样化形式组织实验教学，使学生由浅入深、由简单到综合，逐步认识、理解和掌握动作捕捉原理、数据采集与修复以及复杂动作表演的内容学习。
        实验前统一讲授实验理论；实验中针对不同性质不同要求的复杂动作要求采用不同的处理方式，具体问题具体分析、对待；实验结束后进行总结讨论。学生根据要求，自主选择实验时间和实验方案。
        不是被动地完成学习任务，而是自主思考，从而获得一个宽松的思维和想象的空间，通过自己自主选择、在自己能够接受的水平和基础上，自主设计、实验，解决困难和问题，综合运用所学知识，
        显现自己的智慧和能力，心情愉悦地实验和研究，体验自主实践的成果，充分调动学生实验、实践的积极性和主动性。
    </p>
    <p class="content">
        （3）综合运用先进技术，实现“多维度”动画教学<br>
        通过采用动作捕捉技术和虚拟现实技术，在虚拟仿真实验室中学习动作捕捉技术，通过复杂动作的捕捉，学生可以直观、快捷地掌握动作捕捉的基本流程与方法，学习复杂动作运动规律，
        为动画设计提供多角度、多层面、多方面实验基础。结合了虚拟仿真技术的实验教学，有利于培养学生理论联系实际的作风、严谨求实的科学态度和独立动手的工作能力；有利于帮助学生理解、
        掌握和运用理论知识；有利于学生学会实验准备、分析测试、方案设计、编写报告；有利于学生发展观察思考与创新设计等能力；有利于学生增强社会责任感，增强就业竞争力和社会发展力。
    </p>
    <p class="content">
        （4）培养和提高学生专业创造性<br>
        学生在动画设计学习过程中，往往会被一些复杂动作的制作束缚，影响整个动画动作制作的流畅度和节奏感，因此通过该虚拟教学实验的学习，在传统动画教学基础上，随着实验过程中新现象的不断出现，
        学习兴趣的不断浓厚、求知欲的不断提高和好奇心的不断强化而被激发的实验教学既对理论教育中较为抽象的、难以被学生理解的知识点进行检验和印证，又补充了理论教育之不足，
        更为重要的是由此激发了学生的兴趣和求知欲，是培养学生在承传与创新、规范与突破、发展与改革、理论联系实际、独立思考与交流借鉴相结合的过程中激发和强化创新意识的有效途径，
        是开启学生健全心智的“金钥匙”。实验的过程，不仅需要动手操作、感官观察，还需要学生充分调动自己的思维去想象、思考、推测结论。引导学生从实验中发现问题、分析问题，
        并利用所积累的理论和实践知识解决问题，为创新思维的拓展提供了必要的条件。学生在设计实验方案、实施实验步骤、分析实验结果的过程中，会遇到各种各样的困难，这就要求学生开阔思路，
        反复修改实验方案和屡次尝试新的实验方法，直至得到正确的实验结果。科学实验的过程是不断积累经验、不断探索的过程。
    </p>

    <p class="content">
        2、教学方法的实施过程 <br>
        本实验项目在开放式虚拟仿真实验教学管理和网络共享平台上运行。教师可利用该平台在网上安排学生预习、指导学生实验和批改实验报告，学生可利用该平台在网上进行选课、预习、自主测试、
        自主设计实验以及撰写和提交实验报告。教学系统提供一体化的教学过程管理，学生在理论学习之后，查询相关标准资料，再进入虚拟仿真实验室进行实验。
    </p>

     <p class="content">
        3、教学方法的实施效果  <br>
        在动画专业课程教学和创作过程中，经常会碰到复杂动作设计和绘制，老师在教学过程中只能根据现有资料或者视频截取进行讲解分析的办法提供给学生参考，
        而学生由于资料不全或者没有相关经验往往在学习和创作过程中遇到瓶颈；动作捕捉实验室的建立需要几百万甚至几千万的投入，江苏省高校相关专业有该动作捕捉实验室的屈指可数。
        这些无疑为高校教学和动画创作造成了很大的成本和技术障碍。另一方面，三维动画短片制作过程中，如果需要一套复杂动作的制作，往往需要花费很长时间的制作和数据调整，经过不断渲染，
        反复修改，周期长、效率低，老师和学生往往会把过多时间关注在复杂动作的处理上，而使得整个动画制作过程延长，同时不利于动画短片质量的呈现。以上都给相关课程的教学带来非常大的困难，
        最终导致不能培养出优秀的动画设计人才。
    </p>
    <p class="content">
        （1）利用最新发展的虚拟仿真技术，将复杂动作在仿真环境中体现，可以极大的提高教学过程的直观性和现实性，学生通过在虚拟仿真教学平台的实验和学习，可以掌握动作捕捉的方法与技能，
        熟悉各种实验设备、实验方法，了解当今影视动画动作捕捉设备和设计理念，提高学生综合素质与能力，激发学生学习专业的积极性和主动性，开拓学生的创新意识。
    </p>
    <p class="content">
        （2）通过动画表演动作捕捉虚拟实验的训练，显著提高学生的自学能力、查阅文献资料能力、实验技能和动手能力、分析和解决实际问题的能力。
    </p>
    <p class="content">
       （3）动画表演动作捕捉虚拟实验重视认知，技能，情感等多种目标的协同达成，促进了整体教学目标的推进，注重阶段性目标和方向性目标的有机结合。
    </p>
    <p class="content">
       （4）动画表演动作捕捉虚拟实验能注意到教材知识的纵横向联系，形成知识网络，教学内容的呈现考虑到学生的专业结构特色，合理统筹规划教与学的内容。
    </p>
    <p class="content">
        （5）充分利用动画表演动作捕捉虚拟实验，在动画设计的过程中可以尽早介入，以帮助对动画设计记过相关验证，缩短制作周期，降低制作成本，规避动作僵硬、流畅度的问题。
    </p>
    
    <div class="table-wrap">
        <img src="./image/method01.png" alt="" style="width:450px;height:270px;">
    </div>
    <p class="content">仿真平台24小时向学生开放，在规定的时限内，学生登录仿真平台进入“预习”系统预习实验。</p>
    <div class="table-wrap">
        <img src="./image/method02.png" alt="" style="width:180px;height:370px;">
    </div>
  </div>
</template>

<script>
export default {
  name: "Method",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
    margin-bottom: 15px;
  }
}
</style>
