<template>
  <div class="main">
    <p class="title">实验目的</p>
    <p class="content">
      虚拟现实(Virtual Reality，VR)与数字媒体动画技术相结合，可以形成一种“人能沉浸其中、超越其上、进出自如、交互作用的多维信息空间”。
      VR技术利用计算机设计、生成的交互式三维环境，不仅使参与者能够感到景物或模型十分逼真地存在，而且能对参与者的运动和操作做出实时准确的响应。
      可显著降低实验教学成本、提高实验教学直观性、提高学生的参与度和学习兴趣。本实验的具体目的如下：
    </p>
    <p class="content">
      &nbsp;&nbsp;&nbsp;&nbsp;（一）增进学生对所学课程《动画运动规律》、《动画设计》、《原动画设计》、《动画短片》、《三维动画短片》等课程的理论知识的理解，理论联系实践，培养学生解决实际工作问题的能力。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（二）掌握中间画与原画之间的关系以及中间画的基本绘画原理，了解动画中间线、简单中间画和复杂中间画的内容、特点及绘画要求，掌握中间画的运动规律，并能熟练地运用流畅的线条进行中间画的绘制。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（三）进行实验前理论学习：实验前学生通过平台进行练习、自测等学习实验理论知识。学生在实验过程中遇到问题可以请求指导，系统给出指导信息。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（四）掌握中间画的特点与作用、原画与中间画的关系、中间画的绘画原理以及准备工作。了解角色表演的运动规律，掌握人和物体的运动过程的表现技法，能熟练地表达各种不同剧情中的运动规律和复杂的个性表演以及拟人化的角色表演等不同动作。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（五）掌握原动画设计的原理、方法和技法。能够通过观察生活中的动作进行动画动作的创作，提炼出关键姿势并设计合适的时间，使动作生动流畅。对于非常规动作能够通过经典动作设计学习进行恰当的夸张以满足艺术创作的需求。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（六）掌握动作捕捉制作技术，动作捕捉设备管理、场地尺寸测量、物理空间里物体的定位及方位测定等方面。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（七）掌握虚拟现实技术的动漫场景、游戏地图实验功能。在动漫场景、游戏地图设计的前期设计阶段和后期的应用设计阶段，虚拟现实技术的作用都非常重。前期主要运用环境、场景模拟信息系统做模拟实验进行分析、设计、预演，中期采用模型式虚拟现实系统对镜头、场地进行三维建模和渲染、后期结合专业引擎和镜头语言进行效果表现。<br><br>
    </p>
  </div>
</template>

<script>
export default {
  name: "Purpose",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
    margin-bottom: 15px;
  }
}
</style>
