<template>
  <div class="main">
    <p class="title">实验目的</p>
    <p class="content">
      动作捕捉技术是通过在运动物体的关键位置绑定传感器实时得到运动物体在三维空间中的运动姿态，并实时的将其转化为人体的运动数据，最后再根据所得到的人体运动数据来对虚拟人进行实时驱动的技术。动作捕捉技术最早起源于美国斯坦福大学神经生物力学实验室，当时主要应用于医学领域。20世纪70年代后期，迪斯尼动画公司开始使用动作捕捉技术来改善角色表演动作的效果。近年来，动作捕捉技术得到了突飞猛进的发展，广泛应用到了动画创作、游戏制作、电影特效、人机交互等各艺术领域。将动作捕捉技术用于动画制作，可以极大地提高动画制作的水平。它极大地提高了动画制作的效率，降低了成本，而且使动画制作过程更为直观，效果更为生动。
    </p>
    <p class="content">
      目前，国内很多高校的动画专业均开设了《动画运动规律》、《原画设计》等专业课程，这些课程均涉及动画角色表演动作设计的理论知识和实验环节，学生需要在课程中研究并制作出各类动画角色的多种动作形态，但是对于一些复杂、专业性强的动作的设计，如舞蹈动作、打斗动作、体育运动等，往往工作量相当大而繁重，耗时长，也很难达到精确、细致的效果,更难实现实时效果验证。因此，这类动画角色表演的动作设计的实验教学在课堂中经常是难以开展的。
    </p>
    <p class="content">
      近年来，金陵科技学院的动画专业教学团队通过多年的教学实践和科研成果积累，依托江苏省一级重点学科《设计学》、江苏省品牌专业、江苏省高校重点实验室、国家级精品资源共享课程、国家精品在线开放课程等先进的教学科研平台，基于动作捕捉等技术，开发了“基于动作捕捉技术的动画角色表演设计虚拟仿真实验”,学生通过在线操作该虚拟仿真实验，可以学习和掌握动画角色表演中较为复杂的动作设计的基本内容，动作捕捉仪器设备的使用、动作捕捉技术的标准、操作步骤和数据分析方法，加深对动画表演的特性、动作设计的方法、动画艺术创作的理解，不仅解决了动画中复杂的表演和动作设计教学难以开展的问题，还可应用在动画造型的设计、原动画的设计等环节中，弥补了实验的不足，提高了实验效率，学生全程自主开展实验，从实验中通过虚拟场景搭建和镜头角度、动作速度调整来实时观察实验结果，从而达到“以虚补实，虚实结合，深度交互，理实融合”的教学效果。
    </p>
    <p class="content">
      通过虚拟仿真实验教学，该实验可以帮助学生在以下方面提升实践技能：
    </p>

    <p class="content">
      &nbsp;&nbsp;&nbsp;&nbsp;（1）增进学生对所学课程《动画运动规律》、《动画设计》等课程的理论知识的理解，理论联系实践，培养学生解决实际工作问题的能力。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（2）掌握中间画与原画之间的关系以及中间画的基本绘画原理，了解动画中间线、简单中间画和复杂中间画的内容、特点及绘画要求，掌握中间画的运动规律。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（3）进行实验前理论学习：实验前学生通过平台进行练习、自测等学习实验理论知识。学生在实验过程中遇到问题可以请求指导，系统给出指导信息。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（4）了解角色表演的运动规律，掌握人和物体的运动过程的表现技法，能熟练地表达各种不同剧情中的运动规律和复杂的个性表演以及拟人化的角色表演等不同动作。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（5）掌握原动画设计的原理、方法和技法。能够通过观察生活中的动作进行动画动作的创作，提炼出关键姿势并设计合适的时间，使动作生动流畅。对于非常规动作能够通过经典动作设计学习进行恰当的夸张以满足艺术创作的需求。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（6）掌握镜头角度、动作速度等影视语言的原理、方法和技法。能够通过对已捕捉数据进行线轴的调整，在动作生动流畅的基础上增加镜头感和速度变化，通过效果比对来形成对动作表演的完整认知，极大提高学生的动画创作能力。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（7）掌握动作捕捉制作技术，动作捕捉设备管理、场地尺寸测量、物理空间里物体的定位及方位测定等方面。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（8）掌握动画角色表演在不同条件下的设计要点。强调不同角色、不同场景对于动画角色表演的重要性，同一个标准动作因为角色不同，场景不同，动画角色表演呈现状态应有所不同。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（9）掌握虚拟现实技术的动漫场景、游戏地图实验功能。在动漫场景、游戏地图设计的前期设计阶段和后期的应用设计阶段，虚拟现实技术的作用都非常重。为学生进行毕业设计创作及今后进入动画公司进行商业动画片制作提供实践能力保障。<br><br>
    </p>
  </div>
</template>

<script>
export default {
  name: "Purpose",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
    margin-bottom: 15px;
  }
}
</style>
