<template>
  <div class="main">
    <p class="title">实验原理</p>
    <p class="content">
      在使用本虚拟仿真实验系统学习前，应掌握基本的动画基础相关课程，学习电影、电视动画创作的基础知识与基本理论，掌握动画设计、动画编导、动画创作及理论研究的基本能力；掌握影视动画创作的基本理论、基本知识；掌握影视动画设计及制作的技能。
    </p>
  
    <p class="content">
 动画课程涉及角色表演动作设计的理论知识和实验环节，学生需要在课程中研究并制作出各类动画角色的多种动作形态，对于复杂、专业性强的动作的设计，如舞蹈动作、打斗动作、体育运动等，需要达到精确、细致的效果。通过在线操作该虚拟仿真实验，展示动画角色表演中较为复杂的动作设计的基本内容，以及动作捕捉仪器设备的使用、动作捕捉技术的标准、操作步骤和数据分析方法。
    </p>
    <p class="content">
      本虚拟仿真实验对于学生学习和掌握动画角色表演中较为复杂的动作设计的基本内容，将复杂的、专业性强的动作，如舞蹈动作、打斗动作、体育运动等，从节奏、速度、时间等方面，分解为多角度、多侧面的单帧画面，并能够使其的镜头表现丰富化，让复杂动作能够更为直观、明确，学生能够对复杂动作的细节有充分的了解，加深学生对动画表演的特性、动作设计的方法、动画艺术创作的理解。
    </p>

    <p class="content">
      知识点：共 6 个
    </p>
    <p class="content">
      &nbsp;&nbsp;&nbsp;&nbsp;（1）复杂动作设想<br>
      了解角色表演复杂运动的动作设计，掌握人体的运动过程的表现技法，能熟练地进行各种不同剧情和场景中角色的运动形式、复杂的个性表演以及具备动画特性的动作设计。<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（2）舞蹈动作设计
      <br>学习角色表演中复杂的舞蹈动作的设计，掌握舞蹈动作的运动规律与运动轨迹，掌握舞蹈中人体的表现技巧，能将舞蹈动作与剧情、场景、角色个性结合起来进行设计。
      <br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（3）武术动作设计
      <br>学习角色表演中复杂的武术动作的设计，掌握武术动作的运动规律与运动轨迹，掌握武术中人体的表现技巧，能将打斗动作与剧情、场景、角色个性结合起来进行设计。
      <br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（4）体育运动动作设计
      <br>学习角色表演中复杂的体育动作的设计，掌握体育动作的运动规律与运动轨迹，掌握体育运动中人体的表现技巧，能将体育动作与剧情、场景、角色个性结合起来进行设计。
      <br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（5）动作节奏设计
      <br>把握角色动作的节奏，提炼出关键姿势并设计合适的速率，使动作张弛有度、生动流畅。对于某些节点中的非常规动作，能够通过对经典动作设计的学习，进行恰当的夸张以满足动画艺术创作的需求。
      <br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;（6）镜头设计
      <br>学习对于角色表演的复杂运动进行的镜头设计的方法，掌握镜头语言中的景别、角度、构图、运动等基本创作技巧，增强学生在表现复杂动作时的画面镜头感。
      <br><br>
      
    </p>
  </div>
</template>

<script>
export default {
  name: "Theory",

  data() {
    return {
      msg: ""
    };
  }
};
</script>

<style lang="scss" scoped>
@import "../../assets/styles/mixin";
.main {
  width: 66%;
  margin-top: 15px;
  .title {
    @include sc(24px, #333333);
    margin-bottom: 15px;
  }
  .content {
    @include sc(14px, #666666);
    line-height: 22px;
    margin-bottom: 15px;
  }
  .img-wrap {
    @include fc;
    p {
      @include sc(14px, #666666);
      text-align: center;
      line-height: 22px;
      margin-bottom: 15px;
    }
  }
}
</style>
